Evaluation-ZNN/test/apptrackingupdatesznn/dataCollection/Simulacao1_2minComOverload_4minSemOverload/ApproachB/k6-s7zdn_tracing_20210207_004444.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: /load-testing.js
     output: -

  scenarios: (100.00%) 1 scenario, 3 max VUs, 2m30s max duration (incl. graceful stop):
           * default: 3 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 3 VUs  0m00.9s/2m0s

running (0m02.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 3 VUs  0m01.9s/2m0s

running (0m03.0s), 3/3 VUs, 3 complete and 0 interrupted iterations
default   [   2% ] 3 VUs  0m02.9s/2m0s

running (0m04.0s), 3/3 VUs, 3 complete and 0 interrupted iterations
default   [   3% ] 3 VUs  0m03.9s/2m0s

running (0m05.0s), 3/3 VUs, 6 complete and 0 interrupted iterations
default   [   4% ] 3 VUs  0m04.9s/2m0s

running (0m06.0s), 3/3 VUs, 6 complete and 0 interrupted iterations
default   [   5% ] 3 VUs  0m05.9s/2m0s

running (0m07.0s), 3/3 VUs, 9 complete and 0 interrupted iterations
default   [   6% ] 3 VUs  0m06.9s/2m0s

running (0m08.0s), 3/3 VUs, 9 complete and 0 interrupted iterations
default   [   7% ] 3 VUs  0m07.9s/2m0s

running (0m09.0s), 3/3 VUs, 12 complete and 0 interrupted iterations
default   [   7% ] 3 VUs  0m08.9s/2m0s

running (0m10.0s), 3/3 VUs, 12 complete and 0 interrupted iterations
default   [   8% ] 3 VUs  0m09.9s/2m0s

running (0m11.0s), 3/3 VUs, 15 complete and 0 interrupted iterations
default   [   9% ] 3 VUs  0m10.9s/2m0s

running (0m12.0s), 3/3 VUs, 15 complete and 0 interrupted iterations
default   [  10% ] 3 VUs  0m11.9s/2m0s

running (0m13.0s), 3/3 VUs, 18 complete and 0 interrupted iterations
default   [  11% ] 3 VUs  0m12.9s/2m0s

running (0m14.0s), 3/3 VUs, 18 complete and 0 interrupted iterations
default   [  12% ] 3 VUs  0m13.9s/2m0s

running (0m15.0s), 3/3 VUs, 21 complete and 0 interrupted iterations
default   [  12% ] 3 VUs  0m14.9s/2m0s

running (0m16.0s), 3/3 VUs, 21 complete and 0 interrupted iterations
default   [  13% ] 3 VUs  0m15.9s/2m0s

running (0m17.0s), 3/3 VUs, 24 complete and 0 interrupted iterations
default   [  14% ] 3 VUs  0m16.9s/2m0s

running (0m18.0s), 3/3 VUs, 24 complete and 0 interrupted iterations
default   [  15% ] 3 VUs  0m17.9s/2m0s

running (0m19.0s), 3/3 VUs, 27 complete and 0 interrupted iterations
default   [  16% ] 3 VUs  0m18.9s/2m0s

running (0m20.0s), 3/3 VUs, 27 complete and 0 interrupted iterations
default   [  17% ] 3 VUs  0m19.9s/2m0s

running (0m21.0s), 3/3 VUs, 30 complete and 0 interrupted iterations
default   [  17% ] 3 VUs  0m20.9s/2m0s

running (0m22.0s), 3/3 VUs, 30 complete and 0 interrupted iterations
default   [  18% ] 3 VUs  0m21.9s/2m0s

running (0m23.0s), 3/3 VUs, 33 complete and 0 interrupted iterations
default   [  19% ] 3 VUs  0m22.9s/2m0s

running (0m24.0s), 3/3 VUs, 33 complete and 0 interrupted iterations
default   [  20% ] 3 VUs  0m23.9s/2m0s

running (0m25.0s), 3/3 VUs, 36 complete and 0 interrupted iterations
default   [  21% ] 3 VUs  0m24.9s/2m0s

running (0m26.0s), 3/3 VUs, 36 complete and 0 interrupted iterations
default   [  22% ] 3 VUs  0m25.9s/2m0s

running (0m27.0s), 3/3 VUs, 39 complete and 0 interrupted iterations
default   [  22% ] 3 VUs  0m26.9s/2m0s

running (0m28.0s), 3/3 VUs, 39 complete and 0 interrupted iterations
default   [  23% ] 3 VUs  0m27.9s/2m0s

running (0m29.0s), 3/3 VUs, 42 complete and 0 interrupted iterations
default   [  24% ] 3 VUs  0m28.9s/2m0s

running (0m30.0s), 3/3 VUs, 42 complete and 0 interrupted iterations
default   [  25% ] 3 VUs  0m29.9s/2m0s

running (0m31.0s), 3/3 VUs, 45 complete and 0 interrupted iterations
default   [  26% ] 3 VUs  0m30.9s/2m0s

running (0m32.0s), 3/3 VUs, 45 complete and 0 interrupted iterations
default   [  27% ] 3 VUs  0m31.9s/2m0s

running (0m33.0s), 3/3 VUs, 48 complete and 0 interrupted iterations
default   [  27% ] 3 VUs  0m32.9s/2m0s

running (0m34.0s), 3/3 VUs, 48 complete and 0 interrupted iterations
default   [  28% ] 3 VUs  0m33.9s/2m0s

running (0m35.0s), 3/3 VUs, 51 complete and 0 interrupted iterations
default   [  29% ] 3 VUs  0m34.9s/2m0s

running (0m36.0s), 3/3 VUs, 51 complete and 0 interrupted iterations
default   [  30% ] 3 VUs  0m35.9s/2m0s

running (0m37.0s), 3/3 VUs, 54 complete and 0 interrupted iterations
default   [  31% ] 3 VUs  0m36.9s/2m0s

running (0m38.0s), 3/3 VUs, 54 complete and 0 interrupted iterations
default   [  32% ] 3 VUs  0m37.9s/2m0s

running (0m39.0s), 3/3 VUs, 57 complete and 0 interrupted iterations
default   [  32% ] 3 VUs  0m38.9s/2m0s

running (0m40.0s), 3/3 VUs, 57 complete and 0 interrupted iterations
default   [  33% ] 3 VUs  0m39.9s/2m0s

running (0m41.0s), 3/3 VUs, 60 complete and 0 interrupted iterations
default   [  34% ] 3 VUs  0m40.9s/2m0s

running (0m42.0s), 3/3 VUs, 60 complete and 0 interrupted iterations
default   [  35% ] 3 VUs  0m41.9s/2m0s

running (0m43.0s), 3/3 VUs, 63 complete and 0 interrupted iterations
default   [  36% ] 3 VUs  0m42.9s/2m0s

running (0m44.0s), 3/3 VUs, 63 complete and 0 interrupted iterations
default   [  37% ] 3 VUs  0m43.9s/2m0s

running (0m45.0s), 3/3 VUs, 66 complete and 0 interrupted iterations
default   [  37% ] 3 VUs  0m44.9s/2m0s

running (0m46.0s), 3/3 VUs, 66 complete and 0 interrupted iterations
default   [  38% ] 3 VUs  0m45.9s/2m0s

running (0m47.0s), 3/3 VUs, 69 complete and 0 interrupted iterations
default   [  39% ] 3 VUs  0m46.9s/2m0s

running (0m48.0s), 3/3 VUs, 69 complete and 0 interrupted iterations
default   [  40% ] 3 VUs  0m47.9s/2m0s

running (0m49.0s), 3/3 VUs, 72 complete and 0 interrupted iterations
default   [  41% ] 3 VUs  0m48.9s/2m0s

running (0m50.0s), 3/3 VUs, 72 complete and 0 interrupted iterations
default   [  42% ] 3 VUs  0m49.9s/2m0s

running (0m51.0s), 3/3 VUs, 75 complete and 0 interrupted iterations
default   [  42% ] 3 VUs  0m50.9s/2m0s

running (0m52.0s), 3/3 VUs, 75 complete and 0 interrupted iterations
default   [  43% ] 3 VUs  0m51.9s/2m0s

running (0m53.0s), 3/3 VUs, 78 complete and 0 interrupted iterations
default   [  44% ] 3 VUs  0m52.9s/2m0s

running (0m54.0s), 3/3 VUs, 78 complete and 0 interrupted iterations
default   [  45% ] 3 VUs  0m53.9s/2m0s

running (0m55.0s), 3/3 VUs, 81 complete and 0 interrupted iterations
default   [  46% ] 3 VUs  0m54.9s/2m0s

running (0m56.0s), 3/3 VUs, 81 complete and 0 interrupted iterations
default   [  47% ] 3 VUs  0m55.9s/2m0s

running (0m57.0s), 3/3 VUs, 84 complete and 0 interrupted iterations
default   [  47% ] 3 VUs  0m56.9s/2m0s

running (0m58.0s), 3/3 VUs, 84 complete and 0 interrupted iterations
default   [  48% ] 3 VUs  0m57.9s/2m0s

running (0m59.0s), 3/3 VUs, 87 complete and 0 interrupted iterations
default   [  49% ] 3 VUs  0m58.9s/2m0s

running (1m00.0s), 3/3 VUs, 87 complete and 0 interrupted iterations
default   [  50% ] 3 VUs  0m59.9s/2m0s

running (1m01.0s), 3/3 VUs, 90 complete and 0 interrupted iterations
default   [  51% ] 3 VUs  1m00.9s/2m0s

running (1m02.0s), 3/3 VUs, 90 complete and 0 interrupted iterations
default   [  52% ] 3 VUs  1m01.9s/2m0s

running (1m03.0s), 3/3 VUs, 93 complete and 0 interrupted iterations
default   [  52% ] 3 VUs  1m02.9s/2m0s

running (1m04.0s), 3/3 VUs, 93 complete and 0 interrupted iterations
default   [  53% ] 3 VUs  1m03.9s/2m0s

running (1m05.0s), 3/3 VUs, 96 complete and 0 interrupted iterations
default   [  54% ] 3 VUs  1m04.9s/2m0s

running (1m06.0s), 3/3 VUs, 96 complete and 0 interrupted iterations
default   [  55% ] 3 VUs  1m05.9s/2m0s

running (1m07.0s), 3/3 VUs, 99 complete and 0 interrupted iterations
default   [  56% ] 3 VUs  1m06.9s/2m0s

running (1m08.0s), 3/3 VUs, 99 complete and 0 interrupted iterations
default   [  57% ] 3 VUs  1m07.9s/2m0s

running (1m09.0s), 3/3 VUs, 102 complete and 0 interrupted iterations
default   [  57% ] 3 VUs  1m08.9s/2m0s

running (1m10.0s), 3/3 VUs, 102 complete and 0 interrupted iterations
default   [  58% ] 3 VUs  1m09.9s/2m0s

running (1m11.0s), 3/3 VUs, 105 complete and 0 interrupted iterations
default   [  59% ] 3 VUs  1m10.9s/2m0s

running (1m12.0s), 3/3 VUs, 105 complete and 0 interrupted iterations
default   [  60% ] 3 VUs  1m11.9s/2m0s

running (1m13.0s), 3/3 VUs, 108 complete and 0 interrupted iterations
default   [  61% ] 3 VUs  1m12.9s/2m0s

running (1m14.0s), 3/3 VUs, 108 complete and 0 interrupted iterations
default   [  62% ] 3 VUs  1m13.9s/2m0s

running (1m15.0s), 3/3 VUs, 111 complete and 0 interrupted iterations
default   [  62% ] 3 VUs  1m14.9s/2m0s

running (1m16.0s), 3/3 VUs, 111 complete and 0 interrupted iterations
default   [  63% ] 3 VUs  1m15.9s/2m0s

running (1m17.0s), 3/3 VUs, 114 complete and 0 interrupted iterations
default   [  64% ] 3 VUs  1m16.9s/2m0s

running (1m18.0s), 3/3 VUs, 114 complete and 0 interrupted iterations
default   [  65% ] 3 VUs  1m17.9s/2m0s

running (1m19.0s), 3/3 VUs, 117 complete and 0 interrupted iterations
default   [  66% ] 3 VUs  1m18.9s/2m0s

running (1m20.0s), 3/3 VUs, 117 complete and 0 interrupted iterations
default   [  67% ] 3 VUs  1m19.9s/2m0s

running (1m21.0s), 3/3 VUs, 120 complete and 0 interrupted iterations
default   [  67% ] 3 VUs  1m20.9s/2m0s

running (1m22.0s), 3/3 VUs, 120 complete and 0 interrupted iterations
default   [  68% ] 3 VUs  1m21.9s/2m0s

running (1m23.0s), 3/3 VUs, 123 complete and 0 interrupted iterations
default   [  69% ] 3 VUs  1m22.9s/2m0s

running (1m24.0s), 3/3 VUs, 123 complete and 0 interrupted iterations
default   [  70% ] 3 VUs  1m23.9s/2m0s

running (1m25.0s), 3/3 VUs, 126 complete and 0 interrupted iterations
default   [  71% ] 3 VUs  1m24.9s/2m0s

running (1m26.0s), 3/3 VUs, 126 complete and 0 interrupted iterations
default   [  72% ] 3 VUs  1m25.9s/2m0s

running (1m27.0s), 3/3 VUs, 129 complete and 0 interrupted iterations
default   [  72% ] 3 VUs  1m26.9s/2m0s

running (1m28.0s), 3/3 VUs, 129 complete and 0 interrupted iterations
default   [  73% ] 3 VUs  1m27.9s/2m0s

running (1m29.0s), 3/3 VUs, 132 complete and 0 interrupted iterations
default   [  74% ] 3 VUs  1m28.9s/2m0s

running (1m30.0s), 3/3 VUs, 132 complete and 0 interrupted iterations
default   [  75% ] 3 VUs  1m29.9s/2m0s

running (1m31.0s), 3/3 VUs, 135 complete and 0 interrupted iterations
default   [  76% ] 3 VUs  1m30.9s/2m0s

running (1m32.0s), 3/3 VUs, 135 complete and 0 interrupted iterations
default   [  77% ] 3 VUs  1m31.9s/2m0s

running (1m33.0s), 3/3 VUs, 138 complete and 0 interrupted iterations
default   [  77% ] 3 VUs  1m32.9s/2m0s

running (1m34.0s), 3/3 VUs, 138 complete and 0 interrupted iterations
default   [  78% ] 3 VUs  1m33.9s/2m0s

running (1m35.0s), 3/3 VUs, 141 complete and 0 interrupted iterations
default   [  79% ] 3 VUs  1m34.9s/2m0s

running (1m36.0s), 3/3 VUs, 141 complete and 0 interrupted iterations
default   [  80% ] 3 VUs  1m35.9s/2m0s

running (1m37.0s), 3/3 VUs, 144 complete and 0 interrupted iterations
default   [  81% ] 3 VUs  1m36.9s/2m0s

running (1m38.0s), 3/3 VUs, 144 complete and 0 interrupted iterations
default   [  82% ] 3 VUs  1m37.9s/2m0s

running (1m39.0s), 3/3 VUs, 147 complete and 0 interrupted iterations
default   [  82% ] 3 VUs  1m38.9s/2m0s

running (1m40.0s), 3/3 VUs, 147 complete and 0 interrupted iterations
default   [  83% ] 3 VUs  1m39.9s/2m0s

running (1m41.0s), 3/3 VUs, 150 complete and 0 interrupted iterations
default   [  84% ] 3 VUs  1m40.9s/2m0s

running (1m42.0s), 3/3 VUs, 150 complete and 0 interrupted iterations
default   [  85% ] 3 VUs  1m41.9s/2m0s

running (1m43.0s), 3/3 VUs, 153 complete and 0 interrupted iterations
default   [  86% ] 3 VUs  1m42.9s/2m0s

running (1m44.0s), 3/3 VUs, 153 complete and 0 interrupted iterations
default   [  87% ] 3 VUs  1m43.9s/2m0s

running (1m45.0s), 3/3 VUs, 156 complete and 0 interrupted iterations
default   [  87% ] 3 VUs  1m44.9s/2m0s

running (1m46.0s), 3/3 VUs, 156 complete and 0 interrupted iterations
default   [  88% ] 3 VUs  1m45.9s/2m0s

running (1m47.0s), 3/3 VUs, 159 complete and 0 interrupted iterations
default   [  89% ] 3 VUs  1m46.9s/2m0s

running (1m48.0s), 3/3 VUs, 159 complete and 0 interrupted iterations
default   [  90% ] 3 VUs  1m47.9s/2m0s

running (1m49.0s), 3/3 VUs, 162 complete and 0 interrupted iterations
default   [  91% ] 3 VUs  1m48.9s/2m0s

running (1m50.0s), 3/3 VUs, 162 complete and 0 interrupted iterations
default   [  92% ] 3 VUs  1m49.9s/2m0s

running (1m51.0s), 3/3 VUs, 165 complete and 0 interrupted iterations
default   [  92% ] 3 VUs  1m50.9s/2m0s

running (1m52.0s), 3/3 VUs, 165 complete and 0 interrupted iterations
default   [  93% ] 3 VUs  1m51.9s/2m0s

running (1m53.0s), 3/3 VUs, 168 complete and 0 interrupted iterations
default   [  94% ] 3 VUs  1m52.9s/2m0s

running (1m54.0s), 3/3 VUs, 168 complete and 0 interrupted iterations
default   [  95% ] 3 VUs  1m53.9s/2m0s

running (1m55.0s), 3/3 VUs, 171 complete and 0 interrupted iterations
default   [  96% ] 3 VUs  1m54.9s/2m0s

running (1m56.0s), 3/3 VUs, 171 complete and 0 interrupted iterations
default   [  97% ] 3 VUs  1m55.9s/2m0s

running (1m57.0s), 3/3 VUs, 174 complete and 0 interrupted iterations
default   [  97% ] 3 VUs  1m56.9s/2m0s

running (1m58.0s), 3/3 VUs, 174 complete and 0 interrupted iterations
default   [  98% ] 3 VUs  1m57.9s/2m0s

running (1m59.0s), 3/3 VUs, 177 complete and 0 interrupted iterations
default   [  99% ] 3 VUs  1m58.9s/2m0s

running (2m00.0s), 3/3 VUs, 177 complete and 0 interrupted iterations
default   [ 100% ] 3 VUs  1m59.9s/2m0s
time="2021-02-07T03:46:47Z" level=warning msg="Request Failed" error="Post \"undefined/exports/undefined\": unsupported protocol scheme \"\""
time="2021-02-07T03:46:47Z" level=info msg=0 source=console

running (2m00.1s), 0/3 VUs, 180 complete and 0 interrupted iterations
default ✓ [ 100% ] 3 VUs  2m0s

     ✓ is status 200

     █ setup

     █ teardown

     checks.....................: 100.00% ✓ 360 ✗ 0  
     data_received..............: 332 MB  2.8 MB/s
     data_sent..................: 36 kB   296 B/s
     http_req_blocked...........: avg=154.4µs  min=0s      med=5µs     max=16.38ms p(90)=16.89µs p(95)=270.18µs
     http_req_connecting........: avg=127.85µs min=0s      med=0s      max=16.3ms  p(90)=0s      p(95)=207.49µs
     http_req_duration..........: avg=13.68ms  min=0s      med=10.76ms max=83.75ms p(90)=19.98ms p(95)=24.92ms 
     http_req_receiving.........: avg=4.6ms    min=0s      med=3.68ms  max=34.64ms p(90)=8.02ms  p(95)=9.94ms  
     http_req_sending...........: avg=55.68µs  min=0s      med=24.89µs max=6.96ms  p(90)=68.49µs p(95)=89.59µs 
     http_req_tls_handshaking...: avg=0s       min=0s      med=0s      max=0s      p(90)=0s      p(95)=0s      
     http_req_waiting...........: avg=9.02ms   min=0s      med=6.68ms  max=69.7ms  p(90)=11.95ms p(95)=15.59ms 
     http_reqs..................: 361     3.006767/s
     iteration_duration.........: avg=1.97s    min=12.99µs med=2s      max=2.01s   p(90)=2s      p(95)=2s      
     iterations.................: 180     1.499219/s
     vus........................: 3       min=3 max=3
     vus_max....................: 3       min=3 max=3